# CommandMenuItem Class

---
A class representing a single command menu item.
SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UICommandMenuItem
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class CommandMenuItem : MenuItem

    Public Class CommandMenuItem
    	Inherits MenuItem

    public ref class CommandMenuItem : public MenuItem

    type CommandMenuItem =
        class
            inherit MenuItem
        end
The CommandMenuItem type exposes the following members.
| Name| Description
---|---|---
| CommandMenuItem|  Initialize the item data.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from MenuItem)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from MenuItem)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetAvailabilityClassName|  Set availabilityClassName of CommandMenuItem
| SetToolTip|  Set toolTip of CommandMenuItem
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
To add a menu item that can be executed, implement IExternalCommand interface and pass external command class name to CommandMenuItem constructor, create the CommandMenuItem object and use AddItem() method to add the object to context menu.
#### Reference
Autodesk.Revit.UI Namespace